Repository: capri99/docs
Catalog: source/locale/*/LC_MESSAGES/help/apps/desktop-guide.po
Languages: it

source: Using Mattermost Desktop App
it: Usare l'App per Desktop di Mattermost

source: Mattermost desktop applications are available for Windows, Mac and Linux operating systems.
it: L'applicazione desktop per Mattermost è disponibile per i sistemi operativi Windows, Mac e Linux.

source: You can `download the apps directly from our download page <https://about.mattermost.com/downloads/>`__ and visit our `installation guides <https://docs.mattermost.com/install/desktop.html>`__ for help during setup and for troubleshooting tips.
it: Puoi `scaricare le app direttamente dalla nostra pagina di download <https://about.mattermost.com/downloads/>`__ e visitare le nostre `guide di installazione <https://docs.mattermost.com/install/desktop.html>`__ per assistenza durante l'installazione e per suggerimenti sulla risoluzione dei problemi.

source: To view the latest updates, please see our `changelog <https://docs.mattermost.com/help/apps/desktop-changelog.html>`__.
it: Per controllare gli ultimi aggiornamenti, consulta il nostro `changelog <https://docs.mattermost.com/help/apps/desktop-changelog.html>`__.

source: Below are a few tips to get you started and to configure your experience on the desktop app:
it: Di seguito sono riportati alcuni suggerimenti per iniziare e configurare la tua esperienza utente sull'app desktop:

source: Server Management
it: Gestione del Server

source: You can connect to multiple Mattermost servers from a single interface on the desktop app. Servers appear as separate tabs at the top of the desktop window and can be reordered by dragging.
it: È possibile connettersi a più server Mattermost da un'unica interfaccia sull'app desktop. I server vengono visualizzati come schede separate nella parte superiore della finestra del desktop e possono essere riordinati trascinandoli.

source: The Server Management section allows you to add, edit, and remove servers.
it: La sezione Gestione server consente di aggiungere, modificare e rimuovere server.

source: Adding Servers
it: Aggiungere Server

source: To add a new server to your desktop app environment:
it: Per aggiungere un nuovo server all'ambiente della tua app desktop:

source: Click the **+** button in the desktop window bar at the top of the screen.
it: Fai click sul pulsante **+** nella barra della finestra del desktop nella parte superiore dello schermo.

source: In the **Name** field, enter the name that you want for the tab.
it: Nel campo **Name**, inserisci il nome che preferisci per la scheda.

source: In the **URL** field, enter the complete URL of the server that you want to connect to. Must begin with either ``http://`` or ``https://``.
it: Nel campo **URL**, inserisci l'URL completo del server a cui vuoi connetterti. Deve iniziare con ``http://`` o ``https://``.

source: Click **Add**.
it: Fai click su **Add**.

source: Editing Servers
it: Modificare i Server

source: To edit a server in your desktop app environment:
it: Per modificare un server nell'ambiente dell'app desktop:

source: On Windows, go to **... > File > Settings**. On Mac, go to **Mattermost > Preferences**.
it: Su Windows, vai in **... > File > Settings**. Su Mac vai in **Mattermost > Preferences**.

source: Next to the server you want to update, click **Edit**.
it: Vicino al server che vuoi aggiornare, fai click su **Edit**.

source: Edit **Name** and/or **URL**.
it: Modifica **Name** e/o **URL**.

source: Click **Save**.
it: Fai click su **Save**.

source: Removing Servers
it: Rimuovere i Server

source: To remove a server from your desktop app environment:
it: Per rimuovere un server dall'ambiente dell'app desktop:

source: Next to the server or team that you want to remove, click **Remove**.
it: Vicino al server o al team che vuoi rimuovere, fai click su **Remove**.

source: Click **Remove**.
it: Fai click su **Remove**.

source: App Options
it: Aggiungere Opzioni

source: In addition to `Mattermost Account Settings <https://docs.mattermost.com/help/settings/account-settings.html>`__ , the desktop app provides additional options to customize your experience.
it: Oltre alle `Impostazioni account di Mattermost <https://docs.mattermost.com/help/settings/account-settings.html>`__, l'app desktop offre opzioni aggiuntive per personalizzare la tua esperienza utente.

source: The options appear in the Settings page, available on Windows from **... > File > Settings**, or on Mac from **Mattermost > Preferences**.
it: Le opzioni vengono visualizzate nella pagina Settings, disponibile su Windows in **... > File > Settings** o su Mac in **Mattermost > Preferences**.

source: Start app on login (Windows, Linux only)
it: Avvia app all'accesso (solo Windows e Linux)

source: When enabled, Mattermost application starts when you log in to your machine.
it: Quando abilitato, l'applicazione Mattermost si avvia quando effettui l'accesso alla tua macchina.

source: This setting is enabled by default.
it: Questo settaggio è abilitato di default.

source: Check spelling
it: Controllo ortografico

source: Highlight misspelled words in your messages. Available for English, French, German, Spanish, and Dutch. To change the spelling language, right-click inside a message box and navigate to **Spelling Languages** in the context menu.
it: Evidenzia le parole errate nei tuoi messaggi. Disponibile per Inglese, Francese, Tedesco, Spagnolo e Olandese. Per cambiare la lingua del controllo ortografico, fai click con il pulsante destro del mouse all'interno di una finestra di messaggio e seleziona **Spelling Languages** nel menu contestuale.

source: Show red badge on taskbar icon to indicate unread messages (Windows, Mac only)
it: Mostra badge rosso sull'icona della barra delle applicazioni per indicare i messaggi non letti (solo Windows, Mac)

source: When enabled, a red badge is shown on the taskbar icon for unread messages with a number count indicating unread mentions or direct messages. If disabled, a red badge is only shown for unread mentions (with a number count).
it: Se abilitato, un badge rosso viene visualizzato sull'icona della barra delle applicazioni per i messaggi non letti con un contatore che indica menzioni non lette o messaggi diretti. Se disabilitato, un badge rosso viene mostrato solo per le menzioni non lette (con un contatore).

source: Flash taskbar icon when a new message is received (Windows, Linux only)
it: Icona della barra delle applicazioni lampeggiante quando viene ricevuto un nuovo messaggio (solo Windows, Linux)

source: Configure whether the taskbar icon flashes for a few messages when a new message is received on any of your active teams and servers.
it: Configura se l'icona della barra delle applicazioni deve lampeggiare per un po' quando viene ricevuto un nuovo messaggio su uno dei tuoi team e server attivi.

source: This setting is disabled by default.
it: Questa impostazione è disabilitata di deafault.

source: Bounce the Dock icon when receiving a notification (Mac only)
it: Rimbalzo della icona sul Dock quando si riceve una notifica (solo Mac)

source: When enabled, the Dock icon will either bounce once or bounce until the user opens the app when receiving a notification.
it: Se abilitato, l'icona del Dock rimbalza una volta o rimbalza finché l'utente non apre l'app quando riceve una notifica.

source: Show Mattermost icon in the menu bar (Mac only)
it: Mostra l'icona di Mattermost nella barra dei menu (solo Mac)

source: When enabled, Mattermost icon is added to the Mac menu bar.
it: Se abilitato, l'icona di Mattermost viene aggiunta alla barra del menu del Mac.

source: Show icon in the notification area (Linux only)
it: Mostra l'icona nell'area di notifica (solo Linux)

source: When enabled, Mattermost icon is added to the Linux notification area.
it: Se abilitato, l'icona di Mattermost viene aggiunta all'area di notifica di Linux.

source: Leave app running in notification center when application window is closed (Linux only)
it: Lascia l'app in esecuzione nel centro notifiche quando la finestra dell'applicazione è chiusa (solo Linux)

source: When enabled, closing the application window will leave the Mattermost desktop app running in your notification center. This can be useful if you want to check for unread mentions while away from the app.
it: Se abilitato, la chiusura della finestra dell'applicazione lascerà in esecuzione l'app desktop di Mattermost nel tuo centro di notifica. Questo può essere utile se vuoi verificare la presenza di menzioni non lette mentre sei attivo sull'app.

source: Use GPU hardware acceleration
it: Usa accelerazione hardware GPU

source: If enabled, Mattermost UI is rendered more efficiently but can lead to decreased stability for some systems. Setting takes effect after restarting the app.
it: Se abilitato, l'interfaccia utente di Mattermost è resa in modo più efficiente ma può portare a una stabilità ridotta per alcuni sistemi. L'impostazione ha effetto dopo il riavvio dell'app.

source: Dark Theme
it: Tema Dark

source: On macOS, the Mattermost desktop app respects the System Preferences appearance setting of the operating system to set the theme of the title bar. On Windows, you can toggle the theme of the Mattermost desktop app title bar in **... > View > Toggle Dark Mode**.
it: Su macOS, l'app desktop di Mattermost rispetta le impostazioni dell'aspetto configurate nelle System Preferences del sistema operativo per impostare il tema della barra del titolo. Su Windows, puoi attivare o disattivare il tema della barra del titolo dell'app desktop di Mattermost in **... > View > Toggle Dark Mode**.
