Repository: capri99/docs
Catalog: source/locale/*/LC_MESSAGES/help/getting-started/accessibility.po
Languages: it

source: Keyboard Accessibility
it: Accessibilità da tastiera

source: Navigational keyboard shortcuts help you use Mattermost without requiring a mouse. Below is a list of supported shortcuts. Elements in focus have a colored outline, as shown here:
it: Le scorciatoie da tastiera per la navigazione ti aiutano a utilizzare Mattermost senza la necessità di un mouse. Di seguito è riportato un elenco di scorciatoie supportate. Gli elementi a fuoco hanno un contorno colorato, come mostrato qui:

source: Shortcut
it: Scorciatoia

source: Description
it: Descrizione

source: F6 (CTRL+F6 on Browser)
it: F6 (CTRL+F6 sul Browser)

source: Move focus to the next section
it: Sposta il focus alla sezione successiva

source: SHIFT+F6 (SHIFT+CTRL+F6 on Browser)
it: SHIFT+F6 (SHIFT+CTRL+F6 sul Browser)

source: Move focus to the previous section
it: Sposta il focus alla sezione precedente

source: Move focus to the next element
it: Sposta il focus all'elemento successivo

source: Move focus to the previous element
it: Sposta il focus all'elemento precedente

source: Up or DOWN
it: Up o DOWN

source: Move focus between messages in the post list or sections in the channel sidebar
it: Sposta il focus tra i messaggi di una lista o tra le sezioni nella barra laterale

source: Take action on the focused element
it: Agisce sull'elemnto che ha selezionato

source: Region Navigation
it: Aree di Navigazione

source: Mattermost has eight regions that can be focused for navigation. Use **F6** (Desktop App) or **CTRL+F6** (Browser) repeatedly to move focus and loop through the regions in this order:
it: Mattermost ha otto aree che possono essere focalizzate per la navigazione. Usa **F6** (App desktop) o **CTRL+F6** (Browser) ripetutamente per spostare lo stato attivo e scorrere le aree in questo ordine:

source: Message list region
it: Area per la lista dei messaggi

source: Message input region
it: Area per l'input dei messaggi

source: Right-hand side message list region
it: Area a destra della lista dei messaggi

source: Right-hand side message input region
it: Area a destra dell'input dei messaggi

source: Team menu region
it: Area del menu per i team

source: Channel sidebar region
it: Area per la barra laterale del canale

source: Channel header region
it: Area per l'header del canale

source: Search
it: Ricerca

source: Message Navigation
it: Navigazione tra i Messaggi

source: When the message list region is focused, use the **UP** or **DOWN** arrow keys to navigate through messages. Press **TAB** to navigate through message actions.
it: Quando l'area dell'elenco messaggi è selezionata, utilizza i tasti freccia **SU** o **GIÙ** per navigare tra i messaggi. Premi **TAB** per navigare tra le azioni dei messaggi.

source: Message Composition
it: Composizione di Messaggi

source: Mattermost is compatible with most popular screen readers. A custom readout is composed for each message by combining the message elements and reading them together in full sentences. Message elements will read in the following order:
it: Mattermost è compatibile con i più diffusi screen reader. Una lettura personalizzata è composta per ogni messaggio combinando gli elementi del messaggio e leggendoli insieme in frasi complete. Gli elementi del messaggio verranno letti nel seguente ordine:

source: Header: Author, timestamp, message type (i.e. parent post or reply)
it: Header: Autore, timestamp, tipo di messaggio (es. post padre o risposta)

source: Main Content: The message content typed by the author
it: Contenuto principale: Il contenuto del messaggio digitato dall'autore

source: Attachments: The number of attachments (if applicable)
it: Allegati: Il numero di allegati (se applicabile)

source: Emoji Reactions: The number of unique emoji reactions (if applicable)
it: Emoji: Il numero di uniche emoji (se applicabile)

source: Flags/Pins: If a message is pinned or flagged (if applicable)
it: Flag/Pin: se un messaggio è fissato o contrassegnato (se applicabile)

source: For example, a message read by a screen reader may sound like the following:
it: Ad esempio, un messaggio letto da uno screen reader può apparire come il seguente:

source: Channel Sidebar Navigation
it: Navigazione della Barra Laterale dei Canali

source: When the channel sidebar region is focused, use the **UP** or **DOWN** arrow keys to focus individual sidebar sections, such as Favorites, Public Channels, Private Channels and Direct Messages. Press **TAB** to navigate through channels or other buttons within a sidebar section.
it: Quando l'area della barra laterale del canale è selezionata, usa i tasti freccia **SU** o **GIÙ** per selezionare le singole sezioni della barra laterale, come Preferiti, Canali pubblici, Canali privati e Messaggi diretti. Premi **TAB** per navigare attraverso i canali o altri pulsanti all'interno di una sezione della barra laterale.
