Repository: capri99/docs
Catalog: source/locale/*/LC_MESSAGES/help/getting-started/configuring-notifications.po
Languages: it

source: Configuring Notifications
it: Configurare le notifiche

source: Direct Messages you
it: Le notifiche push desktop, e-mail e mobile ti avvisano dell'attività in Mattermost. Quando ti unisci a un team, Mattermost ti avviserà dei messaggi diretti a te, quando qualcuno:

source: Mentions your username or first name in a channel
it: Menziona il tuo username o nome proprio in un canale

source: Notifies a channel you're in using @channel or @all
it: Notifica un canale in cui ti trovi usando @channel o @all

source: Uses any `keywords you've configured <https://docs.mattermost.com/help/settings/account-settings.html#words-that-trigger-mentions>`_
it: Usa una `keywords che tu hai configurato <https://docs.mattermost.com/help/settings/account-settings.html#words-that-trigger-mentions>`_

source: Desktop Notifications
it: Notifiche Desktop

source: Desktop notifications are pop-ups that appear in the corner of your main monitor when using Chrome, Firefox, Edge, Safari or the `Mattermost Desktop app <https://mattermost.com/download/#mattermostApps>`_. You can change the default preference to trigger desktop notifications for all messages sent in channels you're a member of, or turn them off entirely.
it: Le notifiche Desktop sono pop-uo che appaiono nell'angolo del tuo monitor principale quando usi Chrone, Firefox, Edge, Safari o l'`app Desktop per Mattermost <https://mattermost.com/download/#mattermostApps>`_. Puoi cambiare le preferenze di default per attivare le notifiche desktop per tutti i messaggi inviato nei canali di cui sei membro, o spegnerle del tutto.

source: Configure desktop notifications in **Account Settings** > **Notifications** > **Desktop Notifications** > **Send Desktop Notifications**.
it: Configura le notifiche desktop in **Account Settings** > **Notifications** > **Desktop Notifications** > **Send Desktop Notifications**.

source: Configure desktop notifications in specific channels in **Channel Menu** > **Notification Preferences** > **Send Desktop Notifications**.
it: Configura le notifiche desktop per canali specifici in **Channel Menu** > **Notification Preferences** > **Send Desktop Notifications**.

source: By default, all channels use the global setting configured in *Account Settings*.
it: Per impostazione predefinita, tutti i canali usano le opzioni globali impostate in *Account Settings*.

source: **Not getting a desktop notification?** See our `FAQ to view the desktop notification flow chart <https://docs.mattermost.com/overview/faq.html?#what-determines-if-a-desktop-notification-should-be-triggered>`_ and see what other factors influence if a notification should be triggered.
it: **Non ricevi le notifiche desktop?** Leggi le nostre `FAQ per controllare il diagramma di flussoe delle notifiche desktop <https://docs.mattermost.com/overview/faq.html?#what-determines-if-a-desktop-notification-should-be-triggered>`_ e e quali altri fattori influenzano l'invio di una notific

source: Configure desktop notification sounds in **Account Settings** > **Notifications** > **Desktop Notifications** > **Desktop Notification Sounds**.
it: Configura i suoni per le notifiche desktop in **Account Settings** > **Notifications** > **Desktop Notifications** > **Desktop Notification Sounds**.

source: Email Notifications
it: Notifiche Email

source: By default, you'll get email notifications if you're not actively using Mattermost. You can change the default preference for email notifications to turn them off entirely.
it: Per impostazione predefinita, riceverai una notifica email se non stai attivamente usando Mattermost. Puoi cambiare le preferenze di default per le notifiche email disabilitandole del tutto.

source: Configure email notifications in **Account Settings** > **Notifications** > **Email Notifications**.
it: Configura le notifiche email in **Account Settings** > **Notifications** > **Email Notifications**.

source: Configure the email address where notifications are sent in **Account Settings** > **General** > **Email**.
it: Configura l'indirizzo email a cui inviare le notifiche in **Account Settings** > **General** > **Email**.

source: Messages in email notifications can be opened in the Mattermost Desktop App, Mobile App or in your browser:
it: I messaggi nelle notifiche email possono essere aperte nell'App Desktop di Mattermost, nell'App Mobile o nel tuo browser:

source: **Not getting an email notification?** See our `FAQ to view the email notification flow chart <https://docs.mattermost.com/overview/faq.html?#what-determines-if-an-email-notification-should-be-triggered>`_ and see what other factors influence if a notification should be triggered.
it: **Non ricevi notifiche email?** Leggi le nostre `FAQ per controllare il diagramma di flusso delle notifiche email <https://docs.mattermost.com/overview/faq.html?#what-determines-if-an-email-notification-should-be-triggered>`_ e controlla quali altri fattori influenzano l'invio di una notifica.

source: Mobile Push Notifications
it: Notifiche Mobile Push

source: Mobile push notifications appear on the lock screen of your mobile device if the Mattermost Android or iOS app is installed. By default, these notifications are triggered when you're not actively using Mattermost, but this is configurable. You can also change the default preference to trigger push notifications for all messages sent in channels you're a member of, or turn them off entirely.
it: Le notifiche mobile push vengono visualizzate nella schermata di blocco del dispositivo mobile se è installata l'app Mattermost Android o iOS. Per impostazione predefinita, queste notifiche vengono attivate quando non si utilizza attivamente Mattermost, ma questo comportamnto è configurabile. Puoi anche modificare le preferenze predefinite per attivare le notifiche push per tutti i messaggi inviati nei canali di cui sei membro o disattivarle completamente.

source: Configure push notifications in **Account Settings** > **Notifications** > **Mobile Push Notifications** > **Send mobile push notifications**.
it: Configura le notifiche push in **Account Settings** > **Notifications** > **Mobile Push Notifications** > **Send mobile push notifications**.

source: Configure when push notifications are sent depending on your status in **Account Settings** > **Notifications** > **Mobile Push Notifications** > **Trigger push notifications when**.
it: Configura quando le notifiche push devono essere inviate dipendentemente dal tuo stato in **Account Settings** > **Notifications** > **Mobile Push Notifications** > **Trigger push notifications when**.

source: Learn more about how Mattermost detects your status as **Online**, **Away** or **Offline** `here <https://docs.mattermost.com/help/getting-started/signing-in.html#setting-your-status>`_.
it: Puoi trovare ulteriori informazioni su come Mattermost determina il tuo stato come **Online**, **Away** o **Offline** `qui <https://docs.mattermost.com/help/getting-started/signing-in.html#setting-your-status>`_.

source: Browser Tab Notifications
it: Notifiche sulla scheda del Browser

source: If Mattermost is open in a browser tab, the favicon updates to notify you of unread messages (\*) and a count of mentions or Direct Messages. Browser tab notifications are available on Firefox and Chrome.
it: Se Mattermost è aperto in una scheda del browser, la favicon si aggiorna per notificarti della presenza di messaggi non letti (\*) e del numero di menzioni o di Messaggi Diretti. Le notifiche sulla scheda del browser sono disponibili per Firefox e Chrome.

source: Muting a Channel
it: Silenziare un Canale

source: Channels in the sidebar are **bold** when there are unread messages in the channel and show a badge count if you are mentioned specifically. To mute a channel so it does not appear unread and you do not recieve notifications, click the channel name at the top of the page to access the **Channel Menu** > **Notification Preferences > Mute channel**.
it: I canali nella barra laterale sono **in grassetto** quando ci sono messaggi non letti nel canale e viene mostrato un badge con un conteggioe se sei menzionato in modo specifico. Per disattivare l'audio di un canale in modo che non appaia non letto e non si ricevano notifiche, fare clic sul nome del canale nella parte superiore della pagina per accedere al **Channel Menu** > **Notification Preferences > Mute channel**.

source: Mentions are triggered by `selected keywords <https://docs.mattermost.com/help/settings/account-settings.html#words-that-trigger-mentions>`_. Learn more about `mentioning teammates <http://docs.mattermost.com/help/messaging/mentioning-teammates.html>`__.
it: Le menzioni sono attvate da `keywords selezionate <https://docs.mattermost.com/help/settings/account-settings.html#words-that-trigger-mentions>`_. Maggiori informazioni sulla menzione dei componenti del team sono disponibili `qui <http://docs.mattermost.com/help/messaging/mentioning-teammates.html>`__.
