Repository: capri99/docs
Catalog: source/locale/*/LC_MESSAGES/help/getting-started/managing-members.po
Languages: it

source: Managing Members
it: Gestire i Membri

source: Inviting Team Members
it: Inviare i Membri di un Team

source: If you have the required permissions, you can add people to your team via a direct invite, a public team invite link, or if they already have an account on the server you can add them to the team yourself.
it: Se disponi dei permessi richiesti, puoi aggiungere persone al tuo team via un invito dietto, il link di invito ad un team pubblico, o se hanno già un account sul server puoi aggiungerli al team tu stesso.

source: From version 5.16, your System Admin can `enable guest access to your server <https://docs.mattermost.com/deployment/guest-accounts.html>`_. A guest is a special role that is restricted to only the channels they have been invited to. When this is enabled, you can invite guests or users external to the organization such as vendors or customers.
it: Dalla versione 5.16, il tuo amministratore di Sistema può, `abilitare l'accesso come ospite al tuo server <https://docs.mattermost.com/deployment/guest-accounts.html>`_. Un ospite è uno speciale ruolo con accesso limitato ai soli canali a cui è stato invitato. Quando questa funzione è stata abilitata, puoi invitare ospiti o utenti esterni all'organizzazione come fornitori o clienti.

source: Direct Invites
it: Inviti Diretti

source: Direct invites are invitation emails sent from your team's server directly to the invited person's email address. A link within the invitation directs them to an account creation page. Invitation links sent by email expire after 48 hours and can only be used once. A System Admin can invalidate all active invitation links via **System Console > Authentication > Signup > Invalidate pending email invites** (or **System Console > Security > Sign Up > Invalidate pending email invites** in versions prior to 5.12).
it: Gli inviti diretti sono email di invito inviati dal tuo server direttamente all'indirizzo email della persona invitata. Un link all'interno dell'invito li redirige alla pagina di creazione dell'account. I link di invito inviati via email sono invalidati dopo 48 ore e possono essere usati una sola volta. Un Amministratore di Sistema può invalidare tutti i link di invito via **System Console > Authentication > Signup > Invalidate pending email invites** (or **System Console > Security > Sign Up > Invalidate pending email invites** nelle versioni precedenti alla 5.12).

source: **To send a direct invite**
it: **Per mandare un invito diretto**

source: Click your username at the top of the Navigation Panel.
it: Fai click sul tuo username in cima al Pannello di Navigazione.

source: Click **Invite People**.
it: Fai click su **Invite People**.

source: If there is a option to invite members and guests, choose **Invite Members**.
it: Se è presente una opzione per invitare membri e ospiti, scegli **Invite Members**.

source: In the **Invite People** field enter the email address of the person you want to add.
it: Nel campo **Invite People** inserisci l'indirizzo email e la persona che vuoi aggiungere.

source: Click **Invite Members**.
it: Fai click su **Invite Members**.

source: **To send an invite to a guest**
it: **Per inviare un invito ad un ospite**

source: If there is a option to invite members and guests, choose **Invite Guests**.
it: Se c'è l'opzione per invitare membri e ospiti, scegli **Invite Guests**.

source: In the **Invite People** field enter the email address of guest you want to add. You can add multiple email addresses to invite more than one guest.
it: Nel campo **Invite People inserisci l'email dell'opsite che vuoi aggiungere. Puoi aggiungere più indirizzi email per invitare più di un opsite.

source: Specify the channels the guest will be able to access.
it: Specifica i canali a cui l'ospite sarà abilitato ad accedere.

source: [Optional] Add a custom message to be included in the invitation to the guest.
it: [Opzionale] Aggiungi un messaggio personalizzato da includere nell'invito per l'ospite.

source: Click **Invite Guests**.
it: Fai click su **Invite Guests**.

source: If you aren't able to see the **Invite Guests** option, confirm with your System Admin that you have the correct permissions.
it: Se non trovi l'opzione **Invite Guests**, chiedi al tuo Amministratore di Sistema se hai i permessi corretti.

source: **To send a direct invite in versions prior to 5.16**
it: **Per mandare un invito diretto in versioni precedenti alla 5.16**

source: Click your username, at the top of the Navigation Panel.
it: Fai click sul tuo username, nella parte alte del Pannello di Navigazione.

source: Click **Send Email Invite** and enter the person's email address along with their first and last name.
it: Fai click su **Send Email Invite** e inserisci l'indirizzo e-mail della persona insieme al nome e cognome.

source: To invite more than one person, click **Add another**.
it: Per invitare più di una persona, fai click su **Add another**.

source: Click **Send Invitation**.
it: Fai click su **Send Invitation**.

source: If you do not see the **Send Email Invite** option, confirm with your System Admin that **System Console > Authentication > Signup > Enable Email Invitations** (or **System Console > Security > Sign Up > Enable Email Invitations** in versions prior to 5.12) is set to ``true``.
it: Se non vedi l'opzioone **Send Email Invite**, chiedi conferma al tuo Amministrazione di Sistema che **System Console > Authentication > Signup > Enable Email Invitations** (o **System Console > Security > Sign Up > Enable Email Invitations** nelle versioni precedenti alla 5.12) è impostato a ``true``.

source: Team Invite Link
it: Link di Inviro al Team

source: The team invite link is a unique URL that directs people to an account creation page for a team. A team invite link can be used by anyone and does not change unless it is re-generated by a Team Admin or System Admin via **Team Settings > General > Invite Code**. For example, the team invite link can be included in a company-wide email to invite all employees to join a Mattermost team.
it: Il link di invito al team è una URL univoca che redirige le persone alla pagina di creazione di un'utenza per un team. Un link di invito al team può essere usata da tutti e non cambia fino a quando non è rigenerato da un Team Admin o dall'Amministrtore di Sistema via **Team Settings > General > Invite Code**. Per esempio, il link di invito al team può essere incluso in una email inviata all'intera azienda per invitare tutti i dipendenti ad unirsi ad un team Mattermost.

source: **To get a team invite link**
it: **Per ottenere un link di invito al team**

source: If there is an option to invite members and guests, choose **Invite Members**.
it: Se è presente una opzione per invitare membri o ospiti, scegli **Invite Members**.

source: Click the **Copy Link** button to save the URL to your clipboard and share it with those you want to invite to the team.
it: Fai click sul bottone **Copy Link** per salvare l'URL negli appunti e condividerla con chi vuoi invitare al tuo team.

source: **To get a team invite link in versions prior to 5.16**
it: **Per ottenere un link di invito al team nelle versioni precedenti alla 5.16**

source: Click **Get Team Invite Link**.
it: Fai click **Get Team Invite Link**.

source: In the window that opens, copy the link and share it with those you want to invite to the team.
it: Nella finestra che verrà aperta, copia il link e condividilo con chi vuoi invitare al team.

source: Adding Someone to Your Team
it: Aggiungere Qualcuno al Tuo Team

source: If someone you want to add to your team already has an account on the server, you can add them to your team without sending an invitation.
it: Se chi vuoi invitare al tuo team ha già un'utenza sul server, puoi aggiungerlo al team senza inviare un invito.

source: **To add someone to your team**
it: **Per aggiungere qualcuno al tuo team**

source: In the **Invite People** menu search for the person you want to add. If the people you want to add are not on the list, then they do not have an account on your server.
it: Nel menu **Invite People** cerca le persone che vuoi aggiungere. Se le persone che vuoi aggiungere non sono nella lista, allora non hanno un account sul tuo server.

source: **To add existing guests to your team**
it: **Per aggiungere un ospite al tuo team**

source: In the **Invite People** menu search for the guest you want to add. If the people you want to add are not on the list, then they do not have an account on your server.
it: Nel menu **Invite People** cerca l'ospite che vuoi aggiungere. Se la persona che vuoi aggiungere non è nella lista, allora non ha un account sul tuo server.

source: Specify the channels the guest will have access to.
it: Specifica i canali a cui l'ospite avrà accesso.

source: If you aren't able to see the **Invite Guests** option, confirm with your System Administrator that you have the correct permissions.
it: Se non puoi vedere l'opzione **Invite Guests**, chiedi conferma al tuo Amministratore di Sistema che hai i permessi corretti.

source: **To add someone to your team in versions prior to 5.16**
it: **Per aggiungere qualcuno al tuo tema nelle versioni precedenti alla 5.16**

source: Click **Add Members to Team**.
it: Fai click su **Add Members to Team**.

source: In the **Add New Members*** window, click the username of the person or people to add to your team. You can type in the search box to filter the list. If the people you want to add are not on the list, then they are either already on your team or they do not have an account on your server.
it: Nella finestra **Add New Members**, fai click sullo username della persona o o delle persone che vuoi aggiungere al tuo team. Puoi anche digitare nella casella di ricerca per filtrare la lista. Se le presone che vuoi aggiungere non sono nella lista, allora o sono già nel tuo team o non hanno un account sul tuo server.

source: System Admins can view and add team membership to individual users on the user profile page (**System Console > Users > User Profile**) by clicking **Add Team**.
it: Gli Amministratori di Sistema possono vedere e aggiungere la partecipazione ad un team per singoli utenti dalla pagina di profilo dell'utente (**System Console > Users > User Profile**) facendo click su **Add Team**.

source: User Roles
it: Ruoli Utente

source: There are six types of user roles with different permission levels in Mattermost: System Admins, Team Admins, Channel Admins, Members, Guests, and Inactive accounts. To view a list of users on the team and what their roles are, Team Admins can go to the three dot **Main Menu** and select **Manage Members**.
it: Esistono sei tipi di ruoli utente con diversi livelli di autorizzazione in Mattermost: Amministratori di Sistema, Amministratori del Team, Amministratori del Canale, Membri, Ospiti e Account Inattivi. Per visualizzare un elenco degli utenti del team e quali sono i loro ruoli, gli Amministratori del Team possono andare alla terza voce del **Main Menu** e selezionare **Manage Members**.

source: Member
it: Membri

source: This is the default role given to users when they join a team. Members have basic permissions on the Mattermost team.
it: Questo è il ruolo di default dato agli utenti quando si uniscono ad un team. I membri hanno permessi di base su un team Mattermost.

source: Channel Admin
it: Amministratore di Canale

source: *Available in Enterprise Edition E10 and higher*
it: *Disponibile nell'Enterprise Edition E10 e superiori*

source: The person who creates a channel is assigned the Channel Admin role for that channel. People with the Channel Admin role have the following privileges:
it: All'utente che crea un canale è assegnato il ruolo di Amministratore di Canale per quel canale. Le persone con il ruolo di Amministratore di Canale hanno i seguenti privilegi:

source: Ability to assign the Channel Admin role to other members of the channel.
it: La possibilità di assegnare il ruolo di Amministratore di Canale ad altri membri del canale.

source: Ability to remove the Channel Admin role from other holders of the Channel Admin role.
it: La possibilità di rimuovere il ruolo di Amministratore di Canale ad altri utenti che detengono quel ruolo.

source: Ability to remove members from the channel.
it: La possibilità di rimuovere membri dal canale.

source: Depending on your system configuration, Channel Admins can be granted special permissions by the System Admin to rename and delete channels.
it: In base alla configurazione del tuo sistme, agli Amministratori di Canale possono essere assegnati permessi speciali dall'Amministratore di Sistema per rinominare e cancellare i canali.

source: Team Admin
it: Amministratore del Team

source: When a team is first created, the person who set it up is made a Team Admin. It is a team-specific role, meaning that someone can be a Team Admin for one team but only a Member on another team. Team Admins have the following privileges:
it: Quando un team è creato la prima volta, la persona che lo ha creato diventa un Amministratore del Team. Questo è un ruolo specifico per team; ciò significa che qualcuno può essere Amministratore per un team ma sono Membro in una altro team. Gli Amministratori del Team hanno i seguenti privilegi:

source: Access to the **Team Settings** menu from the team site main menu.
it: Accesso al menu **Team Settings** dal menu principale del sito del team.

source: Ability to change the team name and import data from Slack export files.
it: La possibilità di cambiare il nome del team e importare dai file di esportazione di Slack.

source: Access to the **Manage Members** menu, where they can control whether team members are a **Member** or a **Team Admin**.
it: Accesso al menu **Manage Members**, da dove si può controllare se i membri del team sono un **Membro** o un **Team Admin**.

source: System Admin
it: Amministratore di Sistema

source: The first user added to a newly-installed Mattermost system is assigned the System Admin role.
it: Al primo utente aggiunto ad un sistema Mattermost appena installato è assegnato il ruolo di Amministratore di Sistema.

source: The System Admin is typically a member of the IT staff and has all the privileges of a Team Admin, along with the following additional privileges:
it: L'Amministratore di Sistema è tipicamente un membro dello staff IT e ha tutti i privilegi di un Ammnistratore di Team con i seguenti privilegi aggiuntivi:

source: Access to the System Console from the main menu in any team site.
it: Accesso alla Console di Sistema dal menu principale di un qualsiasi team.

source: Ability to change any setting on the Mattermost server available in the System Console.
it: La possibilità di cambiare qualsiasi configurazione disponibile sulla Console di Sistema del server Mattermost.

source: Ability to promote and demote other users to and from Guest role.
it: La possibilità di assegnare o togliere ad altri utenti il ruolo di Guest.

source: Ability to deactivate user accounts and to reactivate them.
it: La possibilità di disattivare account utenti e riattivarli.

source: Access to private channels, but only if given the link to the private channel.
it: Accedere a canali privati, ma solo se è dato il link ad un canale privato.

source: A System Admin can view and manage users in **System Console > Users**. They can search users by name, filter users by teams, and filter to view other System Admins as well as inactive users.
it: Un Amministratore di Sistema può vedere e gestire gli utenti in **System Console > Users**. Gli utenti possono essere riceracti per nome, filtrandoli per team e usando filtri per vedere gli altri Amministratori di Sistema come gli utenti inattivi.

source: Guest
it: Ospiti

source: Guest is a role with restricted permissions, which allow organizations to collaborate with users outside of their organization, and control what channels they are in and who they can collaborate with.
it: Guest è un ruolo con pemrssi limitati, che permette alle organizzazioni di collaborare con utenti al di fuori dell'organizzazione stessa, e tenere sotto controllo a quali canali hanno accesso e con chi collaborano.

source: Guests can:
it: Gli ospiti possono:

source: Pin messages to channels.
it: Appuntare messaggi in un canale.

source: Use slash commands (with the exception of those used to invite members).
it: Usare slash command (ad eccezione di quelli usati per invitare membri).

source: Favorite channels.
it: Aggiungere canali ai preferiti.

source: Mute channels.
it: Silenziare canali.

source: Update their account settings.
it: Aggiornare il proprio proprio profilo.

source: Guests cannot:
it: Gli ospiti non possono:

source: Discover public channels.
it: Trovare canali pubblici.

source: Join open teams.
it: Aggiungersi a team esistenti.

source: Create direct messages or group messages with members who aren’t within the same channel.
it: Creare messaggi diretti o di gruppo con membri che non sono all'interno dello stesso canale.

source: User With Personal Access Token Permission
it: Utenti Con Autorizzazione con Access Token Personale

source: A System Admin can enable `personal access tokens <https://docs.mattermost.com/developer/personal-access-tokens.html>`__ and give permissions for that account to create personal access tokens in **System Console > Users**.
it: Un Amministratore di Sistema può abilitare `i token per l'accesso personale <https://docs.mattermost.com/developer/personal-access-tokens.html>`__ e concedere le autorizzazioni per quell'account per creare token di accesso personali in **System Console > Users**.

source: In addition, the System Admin can optionally set the following permissions for the account, useful for integrations and bot accounts:
it: In aggiunta, l'Amministratore di Sistema può opzionalamnete i seguenti permessi per l'account, utili per le integrazioni e gli account per bot:

source: **post:all**: Allows the account to post to all Mattermost channels including direct messages.
it: **post:all**: Permette all'account di inviare messaggi a tutti i canali Mattermost inclusi i messaggi diretti.

source: **post:channels**: Allows the account to post to all Mattermost public channels.
it: **post:channels**: Permette all'account di inviare messaggi in tutti i canali pubblici di Mattermost.

source: Deactivating Users
it: Disattivare Utenti

source: A System Admin can deactivate user accounts by going to **System Console > Users** for a list of all users on the server. The list can be searched and filtered to make finding users easier. Click the user's role and in the menu that opens, click **Deactivate**.
it: Un Amministratore di Sistema può disattivare un account utente andando in **System Console > Users** per ottenere una lista di tutti gli account sul server. Sulla lista possono essre effettuate ricercche e può essere filtrate per trovare utenti più facilmente. Fare click sul ruolo di un utente e nel menu che verrà aperto, fare click su **Deactivate**.

source: When **Deactivate** is selected, the user is logged out of the system, and receives an error message if they try to log back in. The user no longer appears in channel member lists, and they are removed from the team members list. A deactivated account can also be reactivated from the System Console, in which case the user rejoins channels and teams that they previously belonged to.
it: Quando si seleziona **Deactivate**, l'utente viene disconnesso dal sistema e riceve un messaggio di errore se tenta di accedere nuovamente. L'utente non viene più visualizzato negli elenchi dei membri del canale e viene rimosso dalla lista dei membri del team. Un account disattivato può anche essere riattivato dalla Console di sistema, nel qual caso l'utente si ricongiunge ai canali e ai team a cui apparteneva in precedenza.

source: Direct Message channels with deactivated users are hidden in users' sidebars, but can be reopened using the **More...** button or the Channel Switcher (CMD/CTRL + K).
it: I canali di messaggi diretti con utenti disattivati sono nascosti nelle barre laterali degli utenti, ma possono essere riaperti utilizzando il pulsante **More...** o il selettore di canale (CMD/CTRL + K).

source: Mattermost is designed as a system-of-record, so there is not an option to delete users from the Mattermost system, as such an operation could compromise the integrity of message archives.
it: Mattermost è progettato come un sistema di registrazione, quindi non esiste un'opzione per eliminare gli utenti dal sistema Mattermost, poiché tale operazione potrebbe compromettere l'integrità degli archivi dei messaggi.

source: Note that AD/LDAP user accounts cannot be deactivated from Mattermost; they must be deactivated from your Active Directory.
it: Si noti che gli account utente AD/LDAP non possono essere disattivati da Mattermost; devono essere disattivati da Active Directory.

source: Removing a User from a Team or Leaving a Team
it: Rimuovere un Utente da un Team o Lasciare un Team

source: Remove from Team
it: Rimouvere dal Team

source: A Team Admin can remove a user from a team by going to the three dot **Main Menu > Manage Members**, and selecting **Remove From Team** in the dropdown menu beside a user entry.
it: Un amministratore del team può rimuovere un utente da un team accedendo alla terza voce *Main Menu > Manage Members** e selezionando **Remove From Team** nel menu a discesa accanto all'utente.

source: When a user is removed from a team, the team will no longer show up in their team sidebar. If they currently have the team open, they are redirected to the first team that appears on their team sidebar. If they didn't belong to any other teams, the user is sent to the team selection page.
it: Quando un utente viene rimosso da un team, il team non verrà più visualizzato nella barra laterale di propri team. Se attualmente ha il team aperto, sarà reindirizzato al primo team che appare sulla barra laterale dei propri team. Se non appartiene a nessun altro team, l'utente viene reindirizzato alla pagina di selezione dei team.

source: Removing a user from the team does not deactivate the account. The user will still be able to sign in to the site, and join other teams. They will also be able to rejoin the team they were removed from if they receive another invite, or if the team is set to `"Allow any user with an account on this server to join this team" <http://docs.mattermost.com/help/settings/team-settings.html#allow-anyone-to-join-this-team>`__. If the user does rejoin the team, they will no longer belong to the channels they were previously a part of, and they will lose all Admin privileges if they had them previously.
it: La rimozione di un utente dal team non disattiva l'account. L'utente sarà comunque in grado di accedere al sito e unirsi ad altri team. Sarà anche in grado di ricongiungersi al team da cui è stato rimosso se riceve un altro invito, o se il team è impostato su `"Allow any user with an account on this server to join this team" <http://docs.mattermost.com/help/settings/team-settings.html#allow-anyone-to-join-this-team>`__. Se l'utente si unisce nuovamente al team, non apparterrà più ai canali di cui faceva parte in precedenza e perderà tutti i privilegi di amministratore se li aveva precedentemente.
