Repository: capri99/docs
Catalog: source/locale/*/LC_MESSAGES/help/getting-started/managing-members.po
Languages: it

source: A System Admin can also remove users from teams by going to **System Console > Users**, and selecting the dropdown beside a user entry and clicking **Manage Teams**. The list of teams an individual user belongs to can be viewed on the user's profile page via **System Console > Users** and selecting the member's name from the list provided in the **User Configuration** screen.
it: Un Amministratore di Sistema può anche rimuovere gli utenti dai team andando su **System Console > Users** e selezionando il menu a discesa accanto a una voce utente e facendo click su **Manage Teams**. L'elenco dei team a cui appartiene un singolo utente può essere visualizzato sulla pagina del profilo dell'utente tramite**System Console > Users** e selezionando il nome del membro dall'elenco fornito nella schermata **User Configuration**.

source: Leaving a Team
it: Lasciare un Team

source: Users can also choose to remove themselves from a team, by going to the three dot **Main Menu > Leave Team**. This will remove the user from the team, and from all public channels and private channels on the team.
it: Gli utenti possono anche scegliere di rimuovere se stessi da un team, accedendo alla terza voce **Main Menu > Leave Team**. In questo modo l'utente verrà rimosso dal team e da tutti i canali pubblici e privati del team.

source: They will only be able to rejoin the team if it is set to `"Allow any user with an account on this server to join this team" <http://docs.mattermost.com/help/settings/team-settings.html#allow-anyone-to-join-this-team>`__ team, or if they receive a new invite. If they do rejoin, they will no longer be a part of their old channels.
it: Saranno in grado di ricongiungersi al team solo se è impostato su`"Allow any user with an account on this server to join this team" <http://docs.mattermost.com/help/settings/team-settings.html#allow-anyone-to-join-this-team>`__, o se ricevono un nuovo invito. Se si ricongiungono, non faranno più parte dei loro vecchi canali.

source: Obtaining User ID
it: Ottenere lo User ID

source: A unique user ID is sometimes required for configuring certain plugins and other administrative tasks that require identifying specific users. This identifier can be found in both the user list (**System Console > Users**) as well as the individual profile page for each user (**System Console > Users**).
it: A volte è necessario un ID utente univoco per configurare determinati plug-in e altre attività amministrative che richiedono l'identificazione di utenti specifici. Questo identificatore è disponibile sia nella lista utenti (**System Console > Users**) che nella pagina del profilo individuale per ogni utente (**System Console > Users**).
