Repository: capri99/docs
Catalog: source/locale/*/LC_MESSAGES/help/getting-started/messaging-basics.po
Languages: it

source: Messaging Basics
it: Le basi della Messagistica

source: **Write messages** using the text input box at the bottom of the screen. Press ENTER to send a message. Use SHIFT+ENTER to create a new line without sending a message. To send messages on CTRL+ENTER and use ENTER to insert new lines go to **Main Menu** > **Account Settings** > **Advanced** > **Send messages on CTRL+ENTER**.
it: **Scrivi i messaggi** usando la casella di testo nella parte inferiore dello schermo. Premi INVIO per mandadare un messaggio. Usa SHIFT+INVIO per inserire tornare a capo senza inviare un messaggio. Per mandare un messaggio usando CTRL+INVIO e usare INVIO per tornare a capo vai in **Main Menu** > **Account Settings** > **Advanced** > **Send messages on CTRL+ENTER**.

source: **Reply to messages** by clicking the reply arrow next to the message text.
it: **Rispondi ad un messaggio** clickando sulla freccia reply arrow vicino al testo del messaggio.

source: **Notify teammates** when they are needed by typing ``@username``.
it: **Notifica un componente del team** quando necessario digitando ``@username``.

source: **Format your messages** using Markdown that supports text styling, headings, links, emojis, code blocks, block quotes, tables, lists and in-line images.
it: **Formatta i tuoi messaggi** usando Markdown che supporta stili, titoli, collegamenti, emoji, blocchi di codice, virgolette, tabelle, elenchi e immagini in-line.

source: You can use either ``_`` or ``*`` for italics and bold text. See the table below for examples.
it: Puoi usare ``_`` o ``*`` per i testi in corsivo o in grassetto. Vedi la tabella in basso per gli esempi.

source: **Quickly add emojis** by typing ":" followed by two characters, which will open an emoji autocomplete. If the existing emojis don't cover what you want to express, you can also create your own `Custom Emoji <http://docs.mattermost.com/help/settings/custom-emoji.html>`__.
it: **Aggiungi rapidamente emoji** digitando ":" seguito da due caratteri, che aprirà un completamento automatico delle emoji. Se gli emoji esistenti non rappresentano ciò che vuoi esprimere, puoi anche creare il tuo `Emoji personalizzato

source: **Attach files** by dragging and dropping them into Mattermost or clicking the attachment icon in the text input box.
it: **Allega file** trascinandoli in Mattermost oppure clickando sull'icona dell'attachment nella casella per l'insermento dei messaggi.

source: **Flag messages for follow up** by clicking the flag icon next to the message timestamp.
it: **Contrassegna i messaggi per il follow-up** facendo clic sull'icona della bandierina accanto alla data/ora del messaggio.

source: Learn more about:
it: Per saperne di più:

source: `Composing Messages and Replies <http://docs.mattermost.com/help/messaging/sending-messages.html>`__
it: `Comporre Messaggi e Risposte <http://docs.mattermost.com/help/messaging/sending-messages.html>`__

source: `Mentioning Teammates <http://docs.mattermost.com/help/messaging/mentioning-teammates.html>`__
it: `Menzionari gli Appartenenti al Team <http://docs.mattermost.com/help/messaging/mentioning-teammates.html>`__

source: `Formatting Messages using Markdown <http://docs.mattermost.com/help/messaging/formatting-text.html>`__
it: `Formattare Messaggi usando Markdown <http://docs.mattermost.com/help/messaging/formatting-text.html>`__

source: `Attaching Files <http://docs.mattermost.com/help/messaging/attaching-files.html>`__
it: `Allegare File <http://docs.mattermost.com/help/messaging/attaching-files.html>`__

source: `Executing Commands <http://docs.mattermost.com/help/messaging/executing-commands.html>`__
it: `Eseguire Comandi <http://docs.mattermost.com/help/messaging/executing-commands.html>`__
