Repository: capri99/docs
Catalog: source/locale/*/LC_MESSAGES/help/getting-started/organizing.po
Languages: it

source: Organizing Mattermost
it: Organizzare Mattermost

source: The importance of organizing channels increases as Mattermost spreads to thousands of users.
it: L'importanza dell'organizzazione dei canali aumenta man mano che Mattermost si diffonde a migliaia di utenti

source: This document shares best practices from various Mattermost deployments including:
it: Questo documento condivide le migliori pratiche di varie installazioni di Mattermost, tra cui:

source: `The importance of channel names`_
it: `L'importanza dei nomi dei canali`_

source: `How to navigate and organize channels`_
it: `Come navigare tra i canali e organizzarli`_

source: `Channel naming examples`_
it: `Esempi di nomenclatura di canali`_

source: The importance of channel names
it: L'importanza dei nomi dei canali

source: Channels organize communication in Mattermost.
it: I canali organizzano le comunicazioni in Mattermost.

source: When naming or renaming channels, consider the following:
it: Quando assegni un nome ai canali o li rinomini, tieni in considerazione i seguenti aspetti:

source: Basic Structure
it: Struttura di Base

source: Channel names appear in menus where users select which conversations to join.
it: I nomi dei canali appaiono nei menu in cui gli utenti selezionano le conversazioni a cui unirsi.

source: Channel names are unique.
it: I nomi dei canali sono univoci.

source: Channel names have a 64 character limit to ensure readability on both desktop and mobile devices.
it: I nomi dei canali hanno un limiti a 64 caratteri per assicurare la leggibilità sia su desktop che su dispositivi mobili.

source: An additional 128 characters are available to add a "Channel Purpose" visible when users are selecting channels.
it: 128 caratteri addizionali sono disponibili per aggiungere un "Channel Purpose" visibile quando gli utenti selezionano i canali.

source: An additional 1024 characters are available for describing the channel in detail in the "Channel Header".
it: Altri 1024 caratteri sono disponibili per descrivere il canale in dettaglio nel "Channel Header".

source: Scoping Names
it: Ambito dei nomi

source: It's natural to start with broadly defined channels and let them divide into narrower topics as discussions progress.
it: È naturale iniziare con canali di carattere generale e dividerli successivamente

source: For example, you might begin with a general "Marketing" channel. As conversations progress, you might divide that channel into: "Marketing: Website", "Marketing: Social Media", "Marketing: General".
it: Ad esempio, potresti iniziare con un canale "Marketing" generico. Man mano che le conversazioni progrediscono, potresti suddividere quel canale in: "Marketing: Website", "Marketing: Social Media", "Marketing: General".

source: Use colons to separate sections of channel names, rather than `` - `` or `` > `` which require more spaces to display.
it: Usa i due-punti per separare le sezioni del nome di un canale, piuttosto di `` - `` o `` > `` che richiedono più spazio per essere mostrati.

source: As the organization grows, disciplines might split across business units, products and geographies, with channel names like "US: Marketing" and "UK: Marketing".
it: Man mano che l'organizzazione cresce, i temi potrebbero dividersi tra unità aziendali, prodotti e aree geografiche, con nomi di canali come "US: Marketing" e "UK: Marketing".

source: If you need to shorten country names, use standard `2-letter country codes <http://www.nationsonline.org/oneworld/country_code_list.htm>`__.
it: Se hai necessità di accorciare i nomi dei paesi, usa il `codice standard a 2 lettere <http://www.nationsonline.org/oneworld/country_code_list.htm>`__.

source: You can combine the hierarchies, with formats like ``[SUB-TEAM]: [TOPIC]: [SUB-TOPIC]``. For example: ``US: Mrkt: Website`` and ``UK: Mrkt: Social Media``.
it: Puoi fare combinazioni di gerarchie con formati come ``[SUB-TEAM]: [TOPIC]: [SUB-TOPIC]``. Per esempio: ``US: Mrkt: Website`` e ``UK: Mrkt: Social Media``.

source: Shorten words, particularly categories, by removing vowels, endings and redundant letter sounds. Example: Turn "Marketing" into "Mrkt", and "Project" into "Prjt".
it: Accorcia le parole, in particolare le categorie, rimuovendo le vocali, i finali e le lettere dal suono ridondante. Per esempio: trasforma "Marketing" in "Mrkt", e "Project" in "Prjt".

source: Good naming can take a team up to several thousand channels without significant confusion. Eventually every organization hits a limit and an additional team might need to be created on the server to accommodate the large number of channels.
it: Una buona nomenclatura può portare un team fino a diverse migliaia di canali senza significative confusioni. Alla fine ogni organizzazione raggiunge un limite e potrebbe essere necessario creare un team aggiuntivo sul server per adattarsi al gran numero di canali.

source: How to navigate and organize channels
it: Come navitra e organizzare i canali

source: With guidance on how to set channel names, here are different navigation options and types of channels to consider:
it: Con le indicazioni su come impostare i nomi dei canali, ci sono diverse opzioni e tipi di navigazione di canali da considerare:

source: Navigating channels using the keyboard
it: Navigare i canali usando la tastiera

source: Keyboard shortcuts allow users to jump between channels.
it: Le scorciatoie da tastiera permettono agli utenti di passare da un canale all'altro.

source: Entering CTRL+K brings up a dialog where users can type in the first few letters of a channel, triggering auto-complete. Pressing ENTER jumps to the channel directly.
it: Digitare CTRL+K fa apparire una finestra di dialogo dove gli utenti possono digitare le prime poche lettere di un canale, attivando l'auto completamento. Premere tasto ENTER per passare direttamente al canale.

source: Keeping names clear and short lets users navigate large collections of channels quickly.
it: Matenere i nomi chiari e corti permette agli utenti di navigare velocemente tra un gran numero di canali.

source: Use ALT+SHIFT+UP and ALT+SHIFT+DOWN to move up and down to the next channel with an unread message.
it: Usa ALT+SHIFT+UP e ALT+SHIFT+DOWN per muoverti su e giù al prossimo canale con messaggi non letti.

source: Topic Channels
it: Topic Channel

source: Topics are broad categories for organizing discussions. Topics are similar to how a user might create a folder for organizing emails or documents::
it: I topic sono ampie categorie per l'organizzazione di discussioni. I topic sono simili a cartelle che un utente potrebbe creare per l'organizzazione di e-mail o documenti ::

source: Users can join and leave topic-based channels, as well as add colleagues to have topic-based discussions.
it: Gli utenti possono unirsi o lasciare canali basati su topic, così come possono aggiungere colleghi per avere discussioni basati su topic.

source: As teams get larger and the number of channels increase, you may start naming topics in a hierarchy to make them easier to find::
it: Quando i team diventano grandi e il numero di canali cresce, puoi cominciare a nominare i topic usando una gerarchia per renderli più facili da trovare::

source: Meeting Channels
it: Meeting Channel

source: Meeting channels are often used to organize regular meetings. Members can add topics as messages to be discussed during the regular meeting time::
it: I Meeting Channel sono spesso usati per organizzare incontri regolari. I membri possono aggiungere topic come messaggi per essere discussi durante regolari incontri::

source: There are three built-in features to make meetings in Mattermost easier:
it: Esistono tre funzionalita precostituite per rendere gli incontri in Mattermost più semplici:

source: Numbered agenda items in title text
it: Elementi dell'agenda numerati nel testo del titolo

source: You can number and format messages as agenda items to discuss for the next meeting.
it: Puoi numerare e formattare i messaggi come una elementi di una agenda per discuterli al prossimo incontro.

source: Try pasting the following as an example in a channel designated for meetings::
it: Prova ad incollare il testo seguente come esempio in un canale creato per le riunioni::

source: Threaded messaging
it: Messaggi a Thread

source: On an agenda item message, you can select ``[...] > Reply`` to leave comments about an agenda item before or after a meeting to extended discussion.
it: Su un messaggio che rappresenta un elemento di agenda, puoi selezionare ``[...] > Reply`` per aggiungere commenti sull'elemento d'agenda o dopo l'incontro per estendere la discussione.

source: Header links
it: Link dell'Header

source: When meeting remotely, add persistent links to your video or audio conferencing solution, like Zoom, Google Hangouts or BlueJeans in the `channel header <https://docs.mattermost.com/help/settings/channel-settings.html#channel-header>`__.
it: Quando l'incontro avviene remotamente, aggiungi un link persistente alla soluzione per la video o audio conferenza, come Zoom, Google Hangouts o BlueJeans nell' `header del canale <https://docs.mattermost.com/help/settings/channel-settings.html#channel-header>`__.

source: When it's time to meet, your team can click the conference link to connect.
it: Quando è arrivato il momento della riunione il tuo team può fare click sul link per connettersi.

source: Sub-Team Channels
it: Canali per Sotto-Team

source: Sub-teams can include people from the same discipline, project teams, people with the same manager or other groups brought together for a shared purpose::
it: I sotto-team possono includere persone interessate alo stesso team, team di progetto, persone con lo stesso manager o altri gruppi riuniti per uno scopo condiviso::

source: As sub-teams grow beyond a manageable size for one channel, they can sub-divide::
it: Man mano che i sottogruppi crescono oltre una dimensione gestibile per un canale, possono suddividersi::

source: Project Channels
it: Canali di Progetto

source: Project channels discuss how groups of people come together to achieve specific outcomes::
it: Nei canali di progetto si discute di come gruppi di persone collaborano per raggiungere risultati specifici::

source: Projects are often private channels rather than public channels and are used to organize a small team around a project brought up in a larger channel. The Project Channel is used to do detailed work, and updates are typically communicated back to larger channels.
it: Quelli di progetto sono spesso canali privati anziché canali pubblici e vengono utilizzati per organizzare un piccolo team attorno a un progetto cresciuto in un canale più ampio. Il canale di progetto viene utilizzato per eseguire compiti di dettaglio e gli aggiornamenti vengono in genere riportati in canali più grandi.

source: Location Channels
it: Canali per Località

source: If your teams are in different buildings, cities or regions, you can create Location channels to help people coordinate meetings and get-togethers::
it: Se i tuoi team si trovano in diversi edifici, città o regioni, puoi creare canali di località per aiutare le persone a coordinare riunioni e incontri::

source: This helps share announcements and discussions relevant to only those locations.
it: Questo aiuta a condividere annunci e discussioni pertinenti solo a quelle località.

source: Data Channels
it: Canali per Dati

source: Data channels allow automatic integration. Information like new or updated support tickets or bug reports, Twitter updates or mentions of your company name in the news can all be made available in channels your team chooses to monitor. There is a wide array of options::
it: I canali di dati consentono l'integrazione automatica. Informazioni come ticket di supporto o segnalazioni di bug nuovi o aggiornati, aggiornamenti di Twitter o menzioni del nome della tua azienda nelle notizie possono essere tutti resi disponibili nei canali che il tuo team sceglie di monitorare. Esiste una vasta gamma di opzioni::

source: People might use these channels like a daily newspaper, reading about everything that's happened in the last day, while other configurations allow notifications to alert only when their username or certain key words are mentioned.
it: Le persone potrebbero usare questi canali come un quotidiano, leggendo tutto ciò che è accaduto nell'ultimo giorno, mentre altre configurazioni permetteno di inviare delle notifiche per avvisare solo quando è citato

source: Channel naming examples
it: Esempi di nomenclatura di canali

source: Here is an example of what a marketer's channels might look like in a small team::
it: Questi sono esempi di come potrebbero essere chiamati i canali di un piccolo team di un rivenditore::

source: Here is an example of what a marketer's channels might look like if she was working in the Palo Alto, California, office of a large enterprise, working on a product called "Pontoon"::
it: Questo è un esempio di come potrebbero essere chiamati i canali di un rivenditore se lavorasse nell'ufficio di una grande impresa di Palo Alto, California, su un prodotto chiamato "Pontoon"::
