Repository: capri99/docs
Catalog: source/locale/*/LC_MESSAGES/help/getting-started/organizing-conversations.po
Languages: it

source: Organizing Conversations
it: Organizzare le conversazioni

source: Conversations in Mattermost are crucial to company productivity and success. Keeping information and messages organized in channels creates an efficient workplace.
it: Le conversazioni in Mattermost sono cruciali per la produttività e il successo aziendale. Mantenere le informazioni e i messaggi organizzati in canali crea uno spazio di lavoro efficente.

source: `Channel Types`_
it: `Tipi di Canale`_

source: `Managing Channels`_
it: `Gestione dei Canali`_

source: Channel Types
it: Tipi di Canale

source: Channels are used to organize conversations across different topics. There are three types of channels: Public Channels, Private Channels, and Direct Messages.
it: I Canali sono usati per organizzare le conversazioni tra argomenti diversi. Eistono tre tipi di canale: Canali Pubblici, Canali Privati, e Messaggi Diretti.

source: Public Channels
it: Canali Pubblici

source: Public Channels are open to everyone on a team. New team members are automatically added to two Public Channels when they sign up: Town Square and Off-Topic.
it: I Canali Pubblici sono aperti a chiunque nel team. I nuovi membri del team sono al loro accesso automaticamente aggiunti a due Canali Pubblici: Town Square e Off-Topic.

source: Private Channels
it: Canali Privati

source: Private Channels are for sensitive topics and are only visible to select team members. In Team Edition, any member of a Private channel can add or remove other members from Private channels, but in Enterprise Edition `these permissions can be restricted to the Channel Admin and System Admin <http://docs.mattermost.com/help/getting-started/managing-members.html#user-roles>`__.
it: I Canali Privati sono usati per argomenti sensibili e sono visibili solamente a membri selezionati del team. Nella Team Edition, ogni membro di un canale Privato può aggiungere o rimuovere altri membri dai canali Privati, ma solo nella Enterprise Edition `questi permessi possonon essere ristretti al Channel Admin e al System Admin <http://docs.mattermost.com/help/getting-started/managing-members.html#user-roles>`__.

source: Direct Messages and Group Messages
it: Messaggi Diretti e Messaggi di Gruppo

source: Direct Messages are for conversations between two people. Group Messages are Direct Messages that have conversations among three or more people. Both are visible only to the people involved.
it: I Messaggi Diretti sono conversazioni tra due persone. I Messaggi di Gruppo sono Messaggi Diretti per conversazioni tra tre o più persone. Entrambi i tipi sono visibili solo alle persone coinvolte.

source: Use a Direct Message when you want a private conversation with one person. Use a Group Message when you want to set up a conversation with up to seven other participants. If you want to communicate with more than seven people, you must create a Private Channel.
it: Usa un Messaggio Diretto quando vuoi una conversazioni private con una sola persona. Usa un Messaggio di Gruppo quando desidere avere una conversazione con al massimo altre sette persone. Se vuoi comunicare con più di sette persone, devi creare un Canale Privato.

source: If your System Administrator has allowed it, you can start a Direct Message or a Group Message with people on other teams.
it: Se il tuo System Administrator ha abilitato questa opzione, puoi inviare Messaggi Diretti o Messaggi di Gruppo a persone di altr team.

source: Check the online status indicator next to names in the Direct Message list. It displays: online (green checkmark indicates active browser), away (orange clock indicates no browser activity for 5 minutes), do not disturb (red dash indicates disabled desktop and push notifications) and offline (white circle indicates browser is closed).
it: Controlla l'indicatore di stato online vicino ai nomi nella lista dei Messaggi Diretti. Viene visualizzato: online (segno di spunta verde indica il browser attivo), away (l'orologio arancione indica nessuna attività del browser per 5 minuti), do not disturb (il trattino rosso indica il desktop disabilitato e le notifiche push) e offline (il cerchio bianco indica che il browser è chiuso).

source: Managing Channels
it: Gestire i Canali

source: Channels can be created, joined, renamed, left and archived.
it: I Canali possono essere creati, ci si può aggiungere, possono essere rinominati, lasciati e archiviati.

source: Creating a Channel
it: Creare un Canale

source: Create a new Public Channel or Private Channel by selecting the **+** symbol next to the *Channels* or *Private Channels* header on the left hand side. To start a direct message thread, click the **+** symbol next to the *Direct Messages* bar or select **More** at the bottom of the list to view team members you can message.
it: Crea un nuovo Canale Pubblico o Canale Privato selezionando il simbolo **+** vicino all'intestazione *Channels* o *Private Channels* sul lato sinistro. Per cominciare un thread di messaggi diretti, clicka sul simbolo **+** vicino alla barra *Direct Messages* o seleziona **More** sotto la lista per visualizzare i membri del team a cui puoi mandare un messaggio.

source: Anyone can create Public Channels or Private Channels, unless the System Administrator has `restricted the permissions <https://docs.mattermost.com/administration/config-settings.html#enable-public-channel-creation-for>`__.
it: Chiunque può creare Canali Pubblici o Canali Privati, a meno che l'Amministratore di Sistema non ha `ristretto i permessi <https://docs.mattermost.com/administration/config-settings.html#enable-public-channel-creation-for>`__.

source: Joining a Channel
it: Unirsi a un Canale

source: Click **More** at the bottom of the *Channels* list to view and search through a list of Public Channels you can join. To join a Private Channel you need to be added by a member of that channel.
it: Clicka su **More** sotto la lista **Channels** per vedere e cercare nella lista dei Canali Pubblici a cui ti sei unito. Per unirti ad un Canale Privato è necessario che tu sia aggiunto da un membro di quel canale.

source: Adding Members to a Channel
it: Aggiungere Membri ad un Canale

source: Click the channel name at the top of the center pane to access the drop-down menu, then click **Add Members**. Any member of a channel can add new members by clicking **Add** next to a user's name. Users already added to the channel will not appear in this modal.
it: Fai click sul nome del canale nella parte superiore del riquadro centrale per accedere al menu a discesa, quindi fai click su **Add Members**. Qualsiasi membro di un canale può aggiungere nuovi membri facendo click su **Add** accanto al nome di un utente. Gli utenti già aggiunti al canale non verranno visualizzati in questa finestra modale.

source: You can also add users to channels within their profile pop-over by clicking "Add to a Channel" and selecting the channel to add them to.
it: Puoi anche aggiungere utenti ai canali dal pop-over del loro profilo clickando su "Add to a Channel" e selezioando il canale a cui aggiungerli.

source: Removing Members from a Channel
it: Rimuovere Membri da un Canale

source: Click the channel name at the top of the center pane to access the drop-down menu, then click **Manage Members**. Any member of a channel can remove other members by clicking **Remove** next to a user's name.
it: Clicka sul nome del canale in cima al pannello centrale per accere al menu a discesa, e poi clicka su **Manage Members**. Ogni membro di un canale può rimuovere altri membri clickando su **Remove** vicino al nome dell'utente.

source: Naming a Channel
it: Assegnare un Nome ad un Canale

source: Channels can be identified in two ways:
it: I Canali possono essere identificati in due modi:

source: Channel display name: This is the channel name appearing in the Mattermost user interface. Click the channel name at the top of the center pane to access the drop-down menu, then click **Rename Channel**. Anyone can rename the channels they belong to, unless the System Administrator has `restricted the permissions <https://docs.mattermost.com/administration/config-settings.html#enable-public-channel-renaming-for>`__.
it: Nome visualizzato del canale: questo è il nome del canale che appare nell'interfaccia utente di Mattermost. Fai click sul nome del canale nella parte superiore del riquadro centrale per accedere al menu a discesa, quindi fai click su **Rename Channel**. Chiunque può rinominare i canali a cui appartiene, a meno che l'Amministratore di Sistema non abbia `limitato le autorizzazioni <https://docs.mattermost.com/administration/config-settings.html#enable-public-channel-renaming-for>`__.

source: Channel handle: This is part of the channel URL. You may also change the channel handle when renaming a channel, but changing channel handles may break existing links.
it: Handle del Canale: è parte dell'URL del canale. Puoi anche modificare l'handle del canale quando lo rinomini un canale, ma la modifica degli handle del canale potrebbe rompere i collegamenti esistenti.

source: For example, per il seguente canale: https://community.mattermost.com/core/channels/ux-design
it: Per esempio, for the following channel: https://community.mattermost.com/core/channels/ux-design

source: Channel display name: ``UX Design``
it: Nome visualizzato del canale: ``UX Design``

source: Channel handle: ``ux-design``
it: Handle del canale: ``ux-design``

source: Leaving a Channel
it: Lasciare un Canale

source: Click the channel name at the top of the center pane to access the drop-down menu, then click **Leave Channel**. Any team member who leaves a Private Channel must be re-added by a channel member if they wish to rejoin. Team members will not receive mention notifications from channels of which they are not members.
it: Fai click sul nome del canale nella parte superiore del riquadro centrale per accedere al menu a discesa, quindi fai click su **Leave Channel*. Qualsiasi membro del team che lascia un canale privato deve essere aggiunto nuovamente da un membro del canale se lo desidera ritornare a farne parte. I membri del team non riceveranno notifiche di menzione dai canali di cui non sono membri.

source: Archiving a Channel
it: Archiviare un Canale

source: Click the channel name at the top of the center pane to access the drop-down menu, then click **Archive Channel**. Anyone can archive the Public Channels or Private Channels they belong to, unless the System Administrator has `restricted the permissions <https://docs.mattermost.com/administration/config-settings.html#id2>`__.
it: Fai click sul nome del canale nella parte superiore del riquadro centrale per accedere al menu a discesa, quindi fai click su **Archive Channel**. Chiunque può archiviare i canali pubblici o privati a cui appartiene, a meno che l'Amministratore di sistema non abbia `limitato autorizzazioni <https://docs.mattermost.com/administration/config-settings.html#id2>`__.

source: When a channel is archived, it is removed from the user interface, but a copy exists on the server in case it is needed for audit reasons later. Because of this, the URL of a newly created channel cannot be the same URL name as an archived channel.
it: Quando un canale viene archiviato, viene rimosso dall'interfaccia utente, ma esiste una copia sul server nel caso in cui fosse necessario per motivi di controllo in un secondo momento. Per questo motivo, l'URL di un canale appena creato non può avere lo stesso nome URL di un canale archiviato.

source: Moreover, when a channel is archived, the contents cannot be viewed, shared or searched by default. If you want to be able to view or search the channel later, either
it: Inoltre, quando un canale viene archiviato, i contenuti non possono essere visualizzati, condivisi o cercati per impostazione predefinita. Se si desidera poter visualizzare o cercare il canale in un secondo momento, o

source: Ask your System Administrator to set ``ExperimentalViewArchivedChannels`` to ``true`` in config.json to allow users to view, share and search for content of channels that have been archived; or
it: Chiedere al tuo Amministratore di Sistema di impostare ``ExperimentalViewArchivedChannels`` a ``true`` nel file config.json per consentire agli utenti di visualizzare, condividere e cercare il contenuto dei canali che sono stati archiviati; o

source: Leave the channel open, but post a message in the channel saying it's considered archived, such as ``# This channel is archived.``
it: Lasciare il canale aperto, ma pubblicare un messaggio nel canale dicendo che èda considerare archiviato, come ``# Questo canale è archiviato.``

source: Converting Public Channels to Private (and vice versa)
it: Convertire un Canale Pubblico in Provato (e viceversa)
