Repository: capri99/docs
Catalog: source/locale/*/LC_MESSAGES/help/getting-started/signing-*.po
Languages: in

source: Signing in
in: Acesso

source: To sign in, navigate to the Mattermost sign-in page. You can get the URL of the sign-in page from your administrator.
in: Per accedere vai alla pagin di sign-in di Mattermost. Puoi ottenere l'URL della pagina di accesso dal tuo amministratore.

source: Sign In Methods
in: Metodi di Accesso

source: There are several options for signing in to your team depending on how your System Admin has configured your server.
in: Eistsono molte opzioni per l'accesso al tua team che dipendono da come l'Amministratore di Sistema ha configurato il tuo server.

source: Email Address or Username Sign In
in: Acesso con Indirizzo Email o Username

source: When enabled by your System Admin, you can sign in with the username or email address used to create your account.
in: Se abilitato dal tuo Amministratore di Sistema, puoi accedere con username o l'indirizzo email usato per create il tuo account.

source: If you have forgotten your password, you can reset it by clicking **I forgot my password** on the sign in screen, or contact your System Admin for help resetting your password.
in: per farti aiutare resettando la tua password.

source: When enabled by your System Admin, you can sign in using your GitLab account using a one-click sign in option.
in: Se abilitato dal tuo Amministratore di Sistema, puoi accedere usando il tuo account Gitlab utilizzando un'opzione di accesso con un click.

source: *Available in Enterprise Edition E20*
in: *Disponibile nell'Enterprise Edition E20*

source: When enabled by your System Admin, you can sign in using your Google account using a one-click sign in option.
in: Se abilitato dall'Amministratore di Sistema, puoi accedere usando il tuo accountGoogle utilizzando un'opzione di accesso con un clic.

source: When enabled by your System Admin, you can sign in using your Office 365 account using a one-click sign in option.
in: Se abilitato dall'Amministratore di Sistema, puoi accedere usando il tuo accountOffice 365 utilizzando un'opzione di accesso con un clic.

source: *Available in Enterprise Edition E10 and E20*
in: *Disponibile nell'Enterprise Edition E20*

source: When enabled by your System Admin, you can sign in with your AD/LDAP credentials. This lets you use the same username and password for Mattermost that you use for various other company services.
in: Se abilitato dall'Amministratore di Sistema, puoi accedere con le tue credenziali AD/LDAP. Ciò ti permetterà di usare anche per Mattermost lo stesso username e la stessa password che usi per i vari altri sistemi aziendali.

source: When enabled by your System Admin, you can sign in with your SAML credentials. This lets you use the same username and password for Mattermost that you use for various other company services. Mattermost officially supports `Okta`_ and `Microsoft ADFS`_ as an identity provider (IDP) for SAML, but you may use other SAML IDPs as well. Please see `documentation`_ to learn more about configuring SAML for Mattermost.
in: Se abilitato dall'Amministratore di Sistema, puoi accedere con le credenziali SAML. Ciò ti consente di utilizzare lo stesso nome utente e password per Mattermost che usi per vari altri servizi aziendali. Mattermost supporta ufficialmente `Okta`_ e` Microsoft ADFS`_ come provider di identità (IDP) per SAML, ma è possibile utilizzare anche altri IDP SAML. Per ulteriori informazioni sulla configurazione di SAML per Mattermost, consultare la `documentazione`.

source: Switching Teams
in: Switchare Team

source: You can switch between teams you have joined using the team sidebar that appears left of your channel list on the left-hand sidebar.
in: Puoi switchare tra i team di cui fai parte usando la la barra laterale che appare a sinistra della lista dei canali sulla barra laterale di sinistra.

source: Setting Your Status
in: Impostare il tuo Stato

source: You can set your status as online, away, do not disturb, or offline by selecting a status from the menu that appears when you click your avatar at the top of the channel list. Do not disturb disables desktop, email and push notifications.
in: Puoi impostare il come online, away, do not disturb o offline selezionando uno stato dal menu che appare quando clicki sul tuo avatar in cime alla lista dei canali. Lo stato **do not disturb** disabilita le notifiche desktop, email e push.

source: How Mattermost determines your status
in: Come Mattermost determina il tuo stato

source: You're interacting with your computer
in: Stai interagendo con il tuo computer

source: You're inactive on your computer for 5 minutes
in: Sei inattivo sul tuo computer da almeno 5 minuti

source: You close Mattermost, sleep or lock your computer
in: Hai chiuso Mattermost, o il tuo computre è in stato sleep o lockato

source: You're interacting with Mattermost in a browser
in: Stai interagendo con Mattermost nel browser

source: You're inactive in the Mattermost browser window for 5 minutes
in: Sei inattivo in nella finestra del browser di Mattermost da almeno 5 minuti

source: You close the Mattermost browser window
in: Hai chiuso la finestra del browser di Mattermost

source: Mattermost is open
in: Mattermost è aperto

source: Mattermost is open with 5 minutes of inactivity
in: Mattermost è aperto con 5 minuti di inattività

source: You switch apps, close Mattermost, or lock your screen
in: Hai switchato app, chiuso mattermost o lockato lo schermo

source: Logging Out
in: Log Out

source: You can log out from the **Main Menu**, which is accessed by clicking the three dots in the top header on the left side of the screen. Clicking **Logout** logs you out of all teams on the server.
in: Puoi effettuare il log aout dal **Main menu**, che è accessibili clickando i tre puntini nell'header superiore sulla parte sinistra dello schermo. Clickando **Logout** effetuerai il log out da tutti i team sul server.

source: iOS Setup
in: Setup su iOS

source: Your Mattermost teams can be accessed on iOS mobile devices by downloading the Mattermost App.
in: I tuuoi team Mattermost possono essere accessibili da dispositivi mobili iOS scaricando l'App Mattermost.

source: Open the `App Store` on your Apple device running iOS 9.0 or later.
in: Apri l'`App Store` dal tuo dispositivo Apple iOS 9.0 o superiore.

source: Search for “Mattermost” and click **GET** to download the App for free.
in: Cerca “Mattermost” e clicka **Ottieni** per scaricare l'App in modo gratuito.

source: Open Mattermost from your homescreen and input your team and account information to login:
in: Apri Mattermost dalla tua schermata iniziale e immetti il tuo team e le informazioni sul tuo account per effettuare la login:

source: Enter Server URL: This is the web address you go to when you want to access Mattermost. You can find the Server URL by asking your System Admin or by looking at the address bar in a desktop browser tab with Mattermost open. It is in the form ``https://domain.com``.
in: Immetti l'URL del server: l'URL è l'indirizzo web a cui ti colleghi quando vuoi accedere a Mattermost. Puoi trovare l'URL del server contattando l'Amministratore di Sistema o controllando la barra degli indirizzi della tab di browser desktop con Mattermost aperto. L'URL è del tipo ``https://domain.com``.

source: Sign in to Mattermost: This is your account login information as described by one of the sign in methods above.
in: Accesso a Mattermost: Sono le informazioni di accesso al tuo account come come descritto da uno dei metodi di accesso visti in precedenza.

source: Android Setup
in: Setup su Android

source: Your Mattermost teams can be accessed on Android mobile devices by downloading the Mattermost App.
in: Puoi accedere al tuo team Mattermost da dispositivi mobili Android scaricando l'App Mattermost.

source: Open the `Google Play Store`_ on your Android device.
in: Apri il `Google Play Store`_ sul tuo dispositivo Android.

source: Search for “Mattermost” and click **INSTALL** to download the App for free.
in: Cerca “Mattermost” and clicka **INSTALLA** per scaricare l'App gratuitamente.
